## Pandas Day1

In [24]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [25]:
df = pd.read_csv('used_cars_data.csv', index_col = 0)

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7253 entries, 0 to 7252
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               7253 non-null   object
 1   Location           7253 non-null   object
 2   Year               7253 non-null   int64
 3   Kilometers_Driven  7253 non-null   int64
 4   Fuel_Type          7253 non-null   object
 5   Transmission       7253 non-null   object
 6   Owner_Type         7253 non-null   object
 7   Mileage            7251 non-null   object
 8   Engine             7207 non-null   object
 9   Power              7207 non-null   object
 10  Seats              7200 non-null   float64
 11  New_Price          1006 non-null   object
 12  Price              6019 non-null   float64
 13  Unnamed: 14        0 non-null      float64
dtypes: float64(3), int64(2), object(9)
memory usage: 850.0+ KB

In [27]:
df.isna().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 46
Power                  46
Seats                  53
New_Price            6247
Price                1234
Unnamed: 14          7253
dtype: int64

In [28]:
# list out all New_price
lst = []
for i in df['New_Price']:
    if i == 'nan':
        lst.append(i)
        continue
    elif str(i).rfind('Lakh') != -1:
        lst.append(float(i[:-5]))
    elif str(i).rfind('Cr') != -1:
        lst.append(float(i[:-3])*100)
    else:
        lst.append(i)

In [29]:
# replace New_Price data with list
df['New_Price'] = lst

In [30]:
# max value
df.rename(columns = {'New_Price':'New_Price(Lakh)'}, inplace = True)

In [31]:
df[df["New_Price(Lakh)"] == df['New_Price(Lakh)'].max()]

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price(Lakh),Price,Unnamed: 14
S.No.,,,,,,,,,,,,,,
6354,Bentley Flying Spur W12,Bangalore,2008,31200,Petrol,Automatic,Second,10.2 kmpl,5998 CC,616 bhp,5.0,375.0,NaN,NaN